# read design 
read_verilog controlador.v

# elaborate design hierarchy
hierarchy -check -top controlador

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt; show -format svg

write_verilog sinte_rtlil.v
