read_verilog controlador.v

hierarchy -check -top controlador

proc; opt; fsm; opt; memory; opt

techmap; opt; show

dfflibmap -liberty ./cmos_cells.lib

abc -liberty ./cmos_cells.lib

show

write_verilog sint_comp.v

clean
